function makestoixeioplhr(tsex, typos) {
    if(tsex == "Lithium") {
            if(typos==0){
                return(`            <li>Το λίθιο είναι το ελαφρύτερο μέταλλο και αντιδρά έντονα με το νερό.</li>
                    <li>Το λίθιο χρησιμοποιείται σε μπαταρίες ιόντων λιθίου, που τροφοδοτούν κινητά τηλέφωνα, φορητούς υπολογιστές και ηλεκτρικά οχήματα.</li>
                    <li>Ανακαλύφθηκε το 1817 από τον Σουηδό χημικό Γιόχαν Αρφβέντσον, ενώ μερικές από τις μεγαλύτερες φυσικές αποθέσεις του βρίσκονται στη Νότια Αμερική.</li>`)
            }
            else{
                return("Λίθιο ")
            }
            }
            
    if(tsex == "Oxygen") {
            if(typos==0){
                return(`            <li>Είναι το πιο άφθονο στοιχείο στη Γη.</li>
                    <li>Απαραίτητο για την αναπνοή και την καύση.</li>
                    <li>Αποτελεί μεγάλο μέρος του ανθρώπινου σώματος</li>`)
            }
            else{
                return("Οξυγόνο ")
            }
            }
            
    if(tsex == "Sodium") {
            if(typos==0){
                return(`            <li>Ρυθμίζει τη μετακίνηση των υγρών στα κύτταρα.</li>
                    <li>Επηρεάζει την ενυδάτωση και το οίδημα.</li>
                    <li>Συμβάλλει στη λειτουργία του νευρικού συστήματος</li>`)
            }
            else{
                return("Νάτριο ")
            }
            }
            
    if(tsex == "Chlorine") {
            if(typos==0){
                return(`            <li>Ρυθμίζει την ισορροπία του νερού στο σώμα.</li>
                    <li>Προστατεύει τα δόντια και τη διαδικασία πέψης.</li>
                    <li>Η έλλειψή του μειώνει τη μυϊκή δύναμη</li>`)
            }
            else{
                return("Χλώριο ")
            }
            }
            
    if(tsex == "Calcium") {
            if(typos==0){
                return(`            <li>Αποθηκεύεται στα οστά και στα δόντια και τα διατηρεί δυνατά </li>
                    <li>Είναι απαραίτητο για τη σωστή συστολή των μυών </li>
                    <li>Βοηθά στη μετάδοση των νευρικών σημάτων και στη ρύθμιση της νευρικής δραστηριότητας </li>`)
            }
            else{
                return("Ασβέστιο")
            }
            }
            
    if(tsex == "Magnesium") {
            if(typos==0){
                return(`            <li>Ρυθμίζει τη συστολή και τη χαλάρωση των μυών </li>
                    <li>Συμβάλλει στην απορρόφηση του ασβεστίου και στην οστική πυκνότητα </li>
                    <li>Βοηθά στη διάσπαση της γλυκόζης</li>`)
            }
            else{
                return("Μαγνήσιο")
            }
            }
            
    if(tsex == "Phosphorus") {
            if(typos==0){
                return(`            <li>Διατηρεί τα οστα και τα δόντια δυνατά</li>
                    <li>Είναι βασικό συστατικό του μορίου που μεταφέρει ενέργεια στα κύτταρα</li>
                    <li>Συμβάλλει στη συστολή των μυών και στη μετάδοση νευρικών σημάτων</li>`)
            }
            else{
                return("Φώσφορος")
            }
            }
            
    if(tsex == "Potassium") {
            if(typos==0){
                return(`            <li>Συμβάλλει στη ρύθμιση της ισορροπίας των υγρών και στη διατήρηση της φυσιολογικής αρτηριακής πίεσης</li>
                    <li>Είναι πολύ δραστικό και αντιδρά με το νερό</li>
                    <li>Χρησιμοποιήσει στην παραγωγή λιπασμάτων </li>`)
            }
            else{
                return("Κάλιο")
            }
            }
            
    if(tsex == "Iron") {
            if(typos==0){
                return(`            <li>Είναι απαραίτητο μέταλλο για τον οργανσμό.</li>
                    <li>Συμβάλλει στη σωστή λειτουργία του ανοσοποιητικού</li>
                    <li>Συμμετέχει σε ενζυμικές αντιδράσεις.</li>`)
            }
            else{
                return("Σίδηρος ")
            }
            }
            
    else{return("")}}